[{"text": "If you are anything like me, you’ve been doing more partying than shopping.  However with the holidays rapidly approaching (it’s like Tomorrow), the time to shop.  Tech items are things us guys need but often don’t buy for yourself. If you are working on a limited budget or shopping for someone you don’t really want [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/12/bose-soundlink-bluetooth-on-ear-headphone-product-photos25-560x350.jpg"]},
{"text": "Damn Daniel!  Nah, seriously..  We can’t get enough of these high-top Vans. Detailed with tiger camo print, white soles, padded vamp and leather Vans stripe at the sides, these re-issues are a fashionable refresh to sneaker collection. At $70, it’s a little pricier than your average Vans, but then again, they aren’t average, now are [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/10/Vans_Vintage_Camo_Pack_Sk8_Hi_Reissue_DrkNvyBlk_VN0A2XSBM61_1.progressive-560x350.jpg"]},
{"text": "Okay, honesty hour? I wasn’t an instant fan of puffer vests.  But as seasons have gone on, I’ve really appreciated the fashion meets function that SOME of them can offer.  Puffer vests are a down or soft material outerwear piece that are often packable and provide warmth and style at the same damn time.  Check [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/10/puffervests-560x350.jpg"]},
{"text": "“Cause she’s loving the crew”-The Weeknd V-neck and turtleneck sweaters often get all the love when it comes to the fall.  However, the crew neck sweater is not only relevant but a must-have.  We spent some time looking for the freshest crew neck sweaters around. The cool thing about crew necks are they still perfect [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/10/636499_mrp_in_l-455x350.jpg"]},
{"text": "Here’s the truth,  the idea of tried and true men’s essentials can often be viewed as boring.A solid red tie, a blue suit, a crisp white shirt, and standard lace-up shoes are an example of said essentials.  However, not only basics not boring, but they are the first place you can have updating and upgrading. [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/10/729962_mrp_in_l1-455x350.jpg"]},
{"text": "Turtlenecks were one of my favorite sweaters to wear as a kid.  Not only are they classic (see: your favorite debonair heroes in the 50s and on), they also serve as a great layering piece and can be dressed  up or down. To say they are trending at this point is a little bit.. late [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/09/81q4tLxb-qL._UL1500_-560x350.jpg"]},
{"text": "Spoiler Alert: Everybody smells. It’s just a fact. Much like morning breath or morning wood, no one is exempt.  However these everyday occurrences are temporary,and once addressed, do not ruin your day. When it comes getting fresh, smelling fresh is the first step. This journey usually starts in the shower. As your singing your favorite [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/09/Old_Spice_Rocket_Car_Endcard-560x350.jpg"]},
{"text": "It’s been about 10 years since I’ve jointed the beard gang. Before the Rick Ross comparisons, the beardgang hashtags and the borderline fetishizing that has happened around my face,  I grew my beard out to combat the issues I had with razor bumps. While there have been strides in the razor bump issue (shout out [...]", "img": ["http://www.fresherthanchris.com/wp-content/uploads/2016/09/image1-3-560x350.jpg"]}]