[
    {
        "heading": "Why you see things you’d never wear on the catwalk",
        "img": [
            "http://gq-images.condecdn.net/image/1zaOgqx2Okw/crop/405",
            "http://gq-images.condecdn.net/image/DRxljp0qPWQ/crop/405",
            "http://gq-images.condecdn.net/image/dZY4a9MgVVX/crop/405"
        ],
        "text": "Story byKathleen Johnston\n        \n             \n        \n    \n                            \n                            \n                            \n                            Saturday 7 January 2017\n                            \n                        \n                    \n\n                    \n                        It’s day two of London Fashion Week Men’s, and images from the catwalks have been flooding in thick and fast. If you’ve seen the images from the MAN show - where Per Götesson, Feng Chen Wang and Charles Jeffrey Loverboy presented their collections - then you’ve probably seen the image of the indescribable papier-mâché blob “look” (don’t worry, we’re not going to call it an outfit) from Charles Jeffrey Loverboy. “No one would ever wear that”, we hear you collectively cry. \n    \n    \n\nWell don’t worry. We can confirm that no matter your fashion credentials, no matter how “edgy” you might perceive your own personal style to be, absolutely no one expects you to wear the conceptual, theatrical pieces you see on the catwalk. The key is to think of them more as props or costumes than as conventional clothing - and never, ever assume that this stuff is supposed to be ready-to-wear. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Chris Yates\n    \n\n    \n\n\n\n\n    \n        Advertisement\n            \n        \n    \nOutlandish runway designs are a form of wearable art, interspersed with the conceivably wearable items for several reasons. First and foremost, designers themselves usually see their shows as an expression of creativity and of their own artistic sensibilities, rather than as purely commercial endeavours. Catwalks shows are about more than just clothes, they’re a holistic, immersive experience. Because we all buy clothes - and because clothing itself is a necessity that we must all engage with to some degree - that’s the bottom line that we tend to forget.For young, independent designers, fresh out of fashion college - and MAN is an initiative specifically intended to showcase emerging talent - their shows are a chance to do something extraordinarily memorable and to get people talking. After all, it’s the bold, experimental shows that get the kudos, as the British Fashion Awards menswear designer of the year Craig Green has proven. Unwearable looks add depth to the collections that will actually be available in shops by emphasising the designers intentions and themes, whether that’s to make an intentionally subversive statement about the “post-truth” insanity of the world we live in (as is the case with Charles Jeffrey Loverboy), or to draw attention to certain cuts, colours and fabrics. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n        Craig Green AW13\n    \n\n\n\n\n    \n        Advertisement\n            \n        \n    \nAnother reason is simply to make things more interesting. Even the youngest editors, front row regulars and faithful fashion followers can become rather jaded - there are 30 catwalk shows on the four day LFWM schedule alone this year (not including the designers showing their collections in presentation form). If you really want to stand out – not to mention getting the kind of media coverage that could make you a household name - you need to do more than dress the models in clothes that would fit right in on your local high street.In our boring, cookie-cutter world, where everyone emulates the same few style icons and where, again and again, we look for rehashes and repeats of the same old stuff - there’s very little out there actually feels new. To create something unlike anything that has been seen before is an aesthetic achievement in itself. At its very core, art is about novelty – and given that designers are fundamentally artists, we must expect them to take artistic risks to get their work noticed. So when you’re flicking through the photo galleries documenting LFWM and the show seasons ahead, remember this: you are viewing a work of art, not a clothes rail. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by press\n    \n\n    \n        Xander Zhouh AW17\n    \n\n\n                    \n\n                    {\"article_uid\": \"yRbAvM61DeZ\"}\n                    \n                        Share this Article"
    },
    {
        "heading": "Your first look at Bottega Veneta's super-luxe summer line",
        "img": [
            "http://gq-images.condecdn.net/image/6eRMm1mEbEw/crop/405"
        ],
        "text": "Story byNick Carvell\n        \n            Nick is Associate Style Editor of British GQ\n        \n    \n                            \n                            \n                            \n                            Wednesday 11 January 2017\n                            \n                        \n                    \n\n                    \n                        If you tuned into the Bottega Veneta's first co-ed show live online last November, you'll know that to celebrate his fifteenth year as creative director, Tomas Maier is currently shaking up the Italian label. However, while the way the brand presents its clothes is changing, there are still certain things that aren't: the first being Maier's dedication to creating louche, completely-covetable menswear using the most superb materials, and the second being his commitment to using the finest photographers to capture them on film every season.Case in point: Bottega Veneta’s Art of Collaboration series, which has been running since Maier joined the comapny in 2001. Having already collaborated with big names like Nan Goldin, Peter Lindbergh and Juergen Teller, this season it's American photographer Todd Hido who's been asked to capture the mood of Bottega Veneta for Spring/Summer 2017.\n\n\n    \n        Advertisement\n            \n        \n    \n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\nThe campaign has been shot in New York City at Paul Rudolph's stunning, Modernist Modulightor Building in Midtown - appropriate considering Hido has made his career shooting urban and suburban architecture across America. Of course, the stark white interiors also provide a convenient canvas for Bottega's colour-heavy new season - as well as its campaign models Joan Smalls, Vittoria Ceretti, Hannes Gobeyn, Morten Nielsen and legendary actress Lauren Hutton (who fans of American Gigolo - aka one of the greatest menswear films of all time - will know carried one of the label's intrecciato bags in the movie).\n\n\n    \n        MORE FASHION\n        \n            \n                \n                \n                \n                    \n                        The women of Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The women of Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        The strongest street style at Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The strongest street style at Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        Jim Chapman on his new year's style resolutions\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Jim Chapman on his new year's style resolutions\n                        \n                    \n                \n                \n                \n                    \n                        Ralph Lauren is opening Mayfair's preppiest new bar\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Ralph Lauren is opening Mayfair's preppiest new bar\n                        \n                    \n                \n            \n        \n    \nDrink in the stunning architecture and superb menswear below...\n\n\n    \n        Advertisement\n            \n        \n    \n\n    \n    \n\n\n    bottegaveneta.com\n\n                    \n\n                    {\"article_uid\": \"PAE745b7b6v\"}\n                    \n                        Share this Article"
    },
    {
        "heading": "Donald Glover is our best-dressed man from the Golden Globes",
        "img": [
            "http://gq-images.condecdn.net/image/bl9PzM0NJJ5/crop/405",
            "http://gq-images.condecdn.net/image/oJ7jW0GvREl/crop/405"
        ],
        "text": "Story byKathleen Johnston\n        \n             \n        \n    \n                            \n                            \n                            \n                            Monday 9 January 2017\n                            \n                        \n                    \n\n                    \n                        Going for a big red carpet risk on one of the most significant nights of your career takes some serious style balls. And last night at the 2017 Golden Globes, that’s exactly what Donald Glover  - aka  recording artist Childish Gambino - did, by going against the grain and opting for a brown velvet Gucci suit for the awards ceremony. Glover, who accepted his first award for Best Comedy Series for Atlanta (which he created, wrote and starred in), broke several big menswear rules - yet he’s still our most stylish man of the night, proving sartorial stipulations can be ignored from time to time. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by PA Photos\n    \n\n    \n\nAmong the sea of traditional black and navy blue suits, Glover’s brown two piece stood out as a bold update for formalwear and as a cool expression of his personal style. Velvet has been making an appearance on the red carpet for some time (see Eddie Redmayne), but we haven’t seen it in this wintery shade of brown before. Velvet has a vintage vibe to it - think gentlemanly smoking jackets - and gives the tuxedo a touch of the Hollywood greats. When it comes to bossing black tie, we’d usually advise that a velvet jacket be worn with black trousers - rather than as part of a full two piece velvet suit - but Glover demonstrates how, with enough swagger, almost any look can be made to work by the individual wearer. Another accepted convention Glover’s look goes against is the pairing of black shoes with a brown suit - his simple Christian Louboutins, just on the right side of shiny, allow the velvet two piece to do the talking.\n\n\n    \n        Advertisement\n            \n        \n    \nIn an era of over-the-top outfitting, Glover’s outfit serves as a great reminder that if you want to stand out, choosing a classic cut in a non-traditional fabric and in an unconventional colour is the way to go. Although that’s not to say that a regular look doesn’t also deserve kudos - our honourable mention goes to Ryan Reynolds, who got traditional black-tie just right in classic Gucci. One thing's for sure gentleman, if you're in need of a great evening suit, you need to get yourselves down to Gucci. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Getty Images\n    \n\n    \n\n\n                    \n\n                    {\"article_uid\": \"BJPWWP5zv2w\"}\n                    \n                        Share this Article"
    },
    {
        "heading": "Jim Chapman on his new year's style resolutions",
        "img": [],
        "text": "Story byJim Chapman\n        \n    \n                            \n                            \n                            \n                            Tuesday 10 January 2017\n                            \n                        \n                    \n\n                    \n                        When the festive season ends, we descend into the cold, dark, return-to-work months. I think that's why resolutions are so popular - it will be a new year and a fresh start, but giving yourself a few goals to focus on is also a decent way of making it through what is arguably the most depressing month in the calendar.With that in mind, I have come up with some wardrobe resolutions to help make it out of January in one piece.\n\n\n    \n        Advertisement\n            \n        \n    \n\n    \n        #ChapmanXLewis jacket and roll neck (link in my bio), @lockhatters hat. A photo posted by Jim Chapman (@jimchapman) on Sep 24, 2016 at 12:41am PDT\n\n\n\n\n\n    \n        MORE FASHION\n        \n            \n                \n                \n                \n                    \n                        The women of Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The women of Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        The strongest street style at Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The strongest street style at Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        Your first look at Bottega Veneta's super-luxe summer line\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Your first look at Bottega Veneta's super-luxe summer line\n                        \n                    \n                \n                \n                \n                    \n                        Ralph Lauren is opening Mayfair's preppiest new bar\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Ralph Lauren is opening Mayfair's preppiest new bar\n                        \n                    \n                \n            \n        \n    \nMy first goal may seem a little incongruous as a style resolution, but hear me out: I want to have fewer clothes in my wardrobe. My friends and family are all kitted out thanks to my hand-me-downs and I feel that my collection now ticks all the boxes. I know that I can make pretty much any outfit from the options that I have and so I think it's time to streamline. I'm a big believer in quality over quantity and I like to invest in my clothes. I look after what I have and I wear items for many years. But you can have too much of a good thing, and owning too many clothes to choose from can be counterproductive. But what stays and what goes? I shall have to be strict with myself and hand down anything that hasn't been worn for a season or longer.\n    \n        A rose between 2 thorns (very sexy @jaguaruk D Type thorns) at #goodwoodrevival. Dressed according to the period in an @alfreddunhill suit, @lockhatters hat and @oliversweeney shoes. Loving life, despite the rain. A photo posted by Jim Chapman (@jimchapman) on Sep 10, 2016 at 7:56am PDT\n\n\n\n\n    \n        Advertisement\n            \n        \n    \n\n\n\n    \n        \n            \n    \n        \n            \n        \n        \n        \n            \n                JIM CHAPMANJim Chapman talks fitness, timekeeping and wardrobes\n                \n            \n            Continue Reading\n        \n    \nAfter saying that, my second resolution seems rather hypocritical, because I do want to buy more clothes for my work-outs. I train up to six times a week and it's a big part of my life, but I'm reluctant to invest in new gear, as I'm only going to sweat in it. However, on the rare occasion that I do get a new T-shirt or pair of shorts, I turn up to the gym with newfound gusto. Anyone who trains regularly can attest to the fact that your head has to be in the game to get the most out of your session and I genuinely feel that when I look right it has a big impact on my work-out.\n    \n        Time to hit the beach! A photo posted by Jim Chapman (@jimchapman) on Sep 13, 2015 at 2:31am PDT\n\n\n\n\n\n    \n        Advertisement\n            \n        \n    \n\n\n\n    \n        \n            \n    \n        \n            \n        \n        \n        \n            \n                GROOMINGJim Chapman breaks down his everyday grooming routine\n                \n            \n            Continue Reading\n        \n    \nMy final style resolution is to wear more hats. Hats and I have a somewhat rocky past; I've always liked the idea of wearing them, but as soon as it's on my head, I become acutely aware of it and feel self-conscious. However, I popped into the St James's hatter Lock & Co recently and had a good, long chat about the right kind of hat for me and came out with four, which I plan to wear all year round.Whatever your resolutions for 2017, be they style-based or not, I hope they help make your January a little more bearable.Like this? Now read:Why you should never wear any of these jeans\n                    \n\n                    {\"article_uid\": \"oMvrRl8pp6x\"}\n                    \n                        Share this Article"
    },
    {
        "heading": "How David Bowie influenced fashion",
        "img": [
            "http://gq-images.condecdn.net/image/dRodpyp5Z9R/crop/405",
            "http://gq-images.condecdn.net/image/mr0DEQEanLQ/crop/405",
            "http://gq-images.condecdn.net/image/vXxwjlA93eV/crop/405",
            "http://gq-images.condecdn.net/image/3E80gdg81Wq/crop/405",
            "http://gq-images.condecdn.net/image/j30QnaxMaAq/crop/405",
            "http://gq-images.condecdn.net/image/7oDlv6bLZn2/crop/405",
            "http://gq-images.condecdn.net/image/kgJjXEGq88Z/crop/405",
            "http://gq-images.condecdn.net/image/xjrL6G6WN6o/crop/405",
            "http://gq-images.condecdn.net/image/WGRYd4OpQKG/crop/405",
            "http://gq-images.condecdn.net/image/DeBw2jdeBo0/crop/405",
            "http://gq-images.condecdn.net/image/D89QmpmmXVG/crop/405",
            "http://gq-images.condecdn.net/image/987Mr3moD6L/crop/405"
        ],
        "text": "Story byRobert Johnston\n        \n            GQ Fashion Director and resident Style Shrink. Follow Robert on Twitter at @realstyleshrink.\n        \n    \n                            \n                            \n                            \n                            Friday 6 January 2017\n                            \n                        \n                    \n\n                    \n                        The early yearsA sharp suited and booted mod at the beginning of his career, it was perhaps David Bowie’s encounter with avant-garde mime artist Lindsay Kemp that shaped the 20-year-old’s lasting belief in the importance of clothes to a performance – indeed Kemp is sometimes credited with having planted the seed that would become Ziggy in his protegé’s mind. As The Guardian’s fashion editor Jess Cartner-Morley says, “Bowie made art out of his clothes.”\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Rex Features\n    \n\n    \n\nAndrogynyHis willingness to push boundaries became apparent with the cover of his third studio album The Man Who Sold The World where he was photographed reclining on a chaise longue in a “man dress” – although the original cover was, in fact, a cartoon. The piece had been designed by Michael Fish who as Mr Fish had been one of Swinging London’s leading trendsetters and the inventor of the kipper tie. Bowie went on to wear the dress for interviews. This underlined his early fascination with androgyny a theme echoed on the cover of his next album Hunky Dory, where Bowie was pictured channelling Marlene Dietrich – another influence that stayed with him in various forms throughout his career.\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Rex Features\n    \n\n    \n\n\n\n\n    \n        Advertisement\n            \n        \n    \n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\nZiggy is bornThe real turning point in Bowie’s fashion progress came with his collaboration with Japanese designer Kansai Yamamoto whom he met when the latter learned that Bowie had been wearing pieces of his womenswear on stage. It was Yamamoto who designed the kimonos and knitted unitards that came to personify the Ziggy Stardust and Aladdin Sane era– and helped invent glam rock. The famous hairstyle was the work of Bowie’s mother Peggy’s hairstylist Suzi Fussey in Beckenham and was inspired by a model in a Yamamoto photo shoot (Fussey later married Bowie’s guitarist Mick Ronson). Not all the tropes of this time were deliberate, however. The famous eyepatch came about when Bowie contracted conjunctivitis before an important interview – he liked the look so much, however, he adopted it. He also claimed that he had shaved off his eyebrows in a fit of pique when Mott The Hoople turned down his song “Drive-In Saturday”.\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Rex Features\n    \n\n    \n\n\n\n\n    \n        MORE FASHION\n        \n            \n                \n                \n                \n                    \n                        The women of Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The women of Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        The strongest street style at Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The strongest street style at Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        Your first look at Bottega Veneta's super-luxe summer line\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Your first look at Bottega Veneta's super-luxe summer line\n                        \n                    \n                \n                \n                \n                    \n                        Jim Chapman on his new year's style resolutions\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Jim Chapman on his new year's style resolutions\n                        \n                    \n                \n            \n        \n    \n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Getty Images\n    \n\n    \n\nThe Thin White DukeThe look, however, had run its course by the time he came to take Diamond Dogs on tour in 1974 and the “cat from Japan” was reinvented as the early soul man in oversized suits, such as the blue Yves Saint Laurent look he wears on the cover of David Live album. Fittingly, when Hedi Slimane took the reins at Saint Laurent he openly cited Bowie as one of his greatest influences and after the singer’s death he penned this tribute for the V&A Magazine, “July 1975. I open my birthday present and I meet David for the first time, at the age of seven. David Live, recorded in Philadelphia one year before, is about to change my life.”Slimane’s biggest influence came from Bowie’s Thin White Duke look from Station To Station in 1976 that carried on through to the Berlin period of Low and Heroes. Monochrome, brooding – taking a simple white shirt and a black waistcoat to create what has to be one of the coolest looks in the history of both menswear and music and one that still informs countless catwalks and campaigns.\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\n\n\n    \n        Advertisement\n            \n        \n    \n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Getty Images\n    \n\n    \n\nThe Eighties Another designer Bowie worked with was Willy Brown, who worked for the massively influential London fashion store Demob on Beak Street in Soho that is credited with helping to shape British fashion in the late Seventies and Eighties. It was Brown who created the pink jumpsuit and duster coat that Bowie wore in the video for the 1979 single “DJ”, which sees the singer pushing through London streets as strangers grab and try to kiss him. Today Brown lives and works in rural Norfolk with his iconic Old Town label.\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Getty Images\n    \n\n    \n\nAfter the Lindsay Kemp inspired Scary Monsters moment, Bowie made what in retrospect looks like one of his rare sartorial missteps with the pastel shoulder-padded suit moment of the Let’s Dance era in the mid-Eighties – although his besuited appearance at Live Aid proved to be one of the greatest musical moments of the decade. While reporting on his “Serious Moonlight” tour Time magazine deemed it noteworthy to comment on the fact that he wore a wristwatch while performing – apparently a very unusual thing at that time. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\n\n\n\n    \n        Advertisement\n            \n        \n    \nThe later yearsBy the late Nineties Bowie started to work with the then upcoming fashion wunderkind Alexander McQueen who created costumes for his 1996 tour, as well as the Union Jack coat Bowie wears on the cover of the 1997 album Earthling. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\nIn August of that same year Bowie was shot for British GQ by fashion director Jo Levin in Paul Smith suits and brown Grenson brogues – the singer had long been a fan of Smith’s work and the designer recalls, “He once came into the Fifth Avenue shop and bought every shirt in his size. It was mind-blowing. Thrilling.” One of the images from this shoot is still on the wall outside the GQ fashion office and looks as fresh today as it did 20 years ago. Not surprisingly in a BBC poll in 2013 Bowie was voted the best-dressed Brit in history. He won 48.5 per cent, beating Elizabeth I into second place.Sadly, the very last project of Bowie’s life was a collaboration with his old friend Smith on a limited-edition Dark Star T-shirt design. Smith had them hanging on the installation he had created for the January 2016 London Collections with the Pace Gallery – it was, by coincidence, the day that the news came through that Bowie had died. \n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Peter Robathan\n    \n\n    \n\n\n                    \n\n                    {\"article_uid\": \"mp6BdLbo5Gq\"}\n                    \n                        Share this Article"
    },
    {
        "heading": "Tinie Tempah is here to shake up British menswear",
        "img": [
            "http://gq-images.condecdn.net/image/zd1Dm28rkL9/crop/405",
            "http://gq-images.condecdn.net/image/M79YLb2ZEjq/crop/405"
        ],
        "text": "Story byNick Carvell\n        \n            Nick is Associate Style Editor of British GQ\n        \n    \n                            \n                            \n                            \n                            Saturday 7 January 2017\n                            \n                        \n                    \n\n                    \n                        Tinie Tempah is undeniably one of our country’s most stylish sons. And unlike many famous men you see on the red carpet, Britain’s biggest rapper hasn’t earned this reputation by always relying on a stylist. This is a man who clearly loves clothes and cares about what he wears. You can see it in his continually evolving style since he burst onto our collective playlists with “Pass Out” in 2009; you can see it in the fact that everything he wears is tailored perfectly for his physique; you can see it in the fact he’s been an ambassador for men’s fashion week in London since it started back in 2011. However, now he’s taking on a new task: translating his personal style into a menswear line.\n    \n    \n\n\n\n\n    \n        Advertisement\n            \n        \n    \nIn vogue with the current trend for big brands shaking up the traditional timetables of the international fashion weeks, Tinie’s new line What We Wear had its debut with a show on the Saturday of the packed schedule of the newly rechristened London Fashion Week Men’s this January. And while he’s dabbled in apparel before with his Disturbing London brand (a mostly-merch line he’s designed with his manager, Dumi Oburota, for almost a decade), this is his first foray into full-blown fashion.\n\n\n    What We Wear Autumn/Winter 2017\n    What We Wear Autumn/Winter 2017\n    \n        \n        \n    \n        \n            \n        \n        \n    \n        \n            \n        \n    \n    \n        \n    \n        \n            \n        \n        \n    \n        \n            \n        \n    \n    \n        \n    \n        \n            \n        \n        \n    \n        \n            \n        \n    \n    \n    View gallery\n\n\n\n    \n        MORE LONDON FASHION WEEK MEN'S\n        \n            \n                \n                \n                \n                    \n                        Inside the London Fashion Week Men’s closing dinner\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            LONDON FASHION WEEK MEN'S Inside the London Fashion Week Men’s closing dinner\n                        \n                    \n                \n                \n                \n                    \n                        The big menswear trends from London Fashion Week Men's AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            LONDON FASHION WEEK MEN'S The big menswear trends from London Fashion Week Men's AW17\n                        \n                    \n                \n                \n                \n                    \n                        Why you see things you’d never wear on the catwalk\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            LONDON FASHION WEEK MEN'S Why you see things you’d never wear on the catwalk\n                        \n                    \n                \n                \n                \n                    \n                        Get a closer look at the items in Tinie Tempah's debut What We Wear line\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            LONDON FASHION WEEK MEN'S Get a closer look at the items in Tinie Tempah's debut What We Wear line\n                        \n                    \n                \n            \n        \n    \nLooking through the collection, Tinie has taken the sporty trend that’s currently running through menswear, and crafted a collection for athleisure-obsessed men. This interchangeability is born out of a controlled palette of navy, black, grey and white, but it’s also in the types of items he’s chosen to include. While his tracksuit (sleek, slim, straightforward and cut from a sheen-like material with extra-long drawstrings at the waist) is the central item in the collection, there are plenty of pieces in the line with which it can be worn to give a whole new vibe: a pair of his slouchy-tailored track trousers, a soft, mid-grey sweatshirt or one of his boxy T-shirts. So far, so sportsluxe.\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Don Fleming\n    \n\n    \n        Tinie Tempah wears a selection of What We Wear, launching in April. From £65 to £400. whatwewear.com\n    \n\n\n\n    \n        Advertisement\n            \n        \n    \nHowever, as with Tinie’s personal style, what sets these items apart are the details: those black track trousers we mentioned have a rubbery white logo artfully squiggling down the side instead of go-faster stripes; that grey sweatshirt has layered-effect sleeves; those boxy T-shirts have press studs all down the shoulders and torso, allowing you to attach the front of one colour to the back of another to create a whole new item. His jean jacket is -traditional in shape and style – however, it’s cut not from denim, but from semi-transparent white rubberised plastic, allowing you to show off what’s underneath, even during a downpour.\n    \"I decided, why don’t we actually make something that we would actually wear?\"\n It’s these unexpected twists that add a fashionable edge – not to mention serious covetability – to every item, and yet, crucially, does not impact on their wearability or practicality. In fact, it’s the twists that enhance these qualities. “When you go to the fashion shows, a lot of the models walking down the catwalk are wearing these extravagant pieces,” says Tinie. “But I’ll see the model in Shoreditch two weeks later and they’ll be wearing something more like this. So I decided, ‘Why don’t we -actually make something we would actually wear?’” Of course, rappers launching clothing brands is nothing new. Over in the US, home of the personal lifestyle brand, most hip hop artists have given it a go. Pharrell and Kanye West have both won over the current streetwear scene with BBC Ice Cream and Yeezy respectively, and P Diddy saw rich rewards from Sean John for many years. 50 Cent, though, wasn’t quite so lucky (RIP G-Unit clothing). However, you get the sense that if there’s any man who can conquer the menswear market, it’s Tinie. Having finished our shoot, for which he’s modelled three of his key looks from the line, we’re now in his living room, located on the first floor with a view of Victoria Park to the front and, behind his grand piano, a view of his own perfectly manicured garden to the rear. He’s reclining on a golden-yellow, Ostrich-leather sofa, sporting one of his own black tracksuits, zipped low to expose his toned chest and a neck hung with delicate gold chains. And he wears it all with the kind of wide-smiled warm confidence that any guy would buy if it could be bottled.\n\n    \n        \n            \n        \n    \n\n    “I felt like it was the right time to make a clothing line that people would acknowledge and respect.”\n\n\n\n    Get a closer look at the items in Tinie Tempah's debut What We Wear line\n    Get a closer look at the items in Tinie Tempah's debut What We Wear line\n    \n        \n        \n    \n        \n            \n        \n        \n    \n        \n            \n        \n    \n    \n        \n    \n        \n            \n        \n        \n    \n        \n            \n        \n    \n    \n    View gallery\nIncidentally, that sofa we mentioned was installed by the house’s previous owner, Alexander McQueen. While Tinie has made his own suitably ballsy additions to the building (we particularly approve of the hot tub on the roof), traces of the designer are everywhere – especially in the artwork, such as the taxidermy giraffe’s head hanging in the stairwell outside, left by the designer before he moved out shortly before his untimely death. These are things Tinie proudly preserves as a constant source of inspiration; they give him faith that, like McQueen, he can become a major player in the British fashion industry.\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n        Photography by Don Fleming\n    \n\n    \n        Tinie Tempah wears a selection of What We Wear, launching in April. From £65 to £400. whatwewear.com\n    \n\n\n\n\n    \n        Advertisement\n            \n        \n    \n“After seeing numerous shows and meeting numerous designers, men like Paul Smith who have given us crazy mentoring lessons, and living in Alexander McQueen’s house, seeing how inspired by Africa he was, it just made me feel like I could do it,” Tinie says. “I felt like it was the right time to make a clothing line that people would acknowledge and respect.” However, this acknowledgement and respect isn’t only something he desires when it comes to his menswear. Eventually he’d like to expand into directing music videos, animation and even architecture (“I’m always thinking of how to make spaces people want to be in. I always dream of having this big spread of land where I can build something that you’d usually see in LA, but in Kent”). How he does this, we can’t predict just yet (although his passion for his collection tells us he’ll give it everything he’s got). What’s certain is that launching What We Wear won’t be the last time Tinie expands his sphere of -influence on his journey to owning a world--dominating personal brand – but it’s one hell of a stylish stop along the way, and one we hope to revisit for many seasons to come.\n    What We Wear launches in April, from £65 to £400. whatwewear.com\n\n\n\n    Your exclusive first look at the What We Wear lookbook\n    Your exclusive first look at the What We Wear lookbook\n    \n        \n        \n    \n        \n            \n        \n        \n    \n        \n            \n        \n    \n    \n        \n    \n        \n            \n        \n        \n    \n        \n            \n        \n    \n    \n    View gallery\n\n                    \n\n                    {\"article_uid\": \"V2q3Yj3XnO4\"}\n                    \n                        Share this Article"
    },
    {
        "heading": "Ralph Lauren is opening Mayfair's preppiest new bar",
        "img": [
            "http://gq-images.condecdn.net/image/jRwxe9JJr4b/crop/405",
            "http://gq-images.condecdn.net/image/yPrAMmx2n9A/crop/405",
            "http://gq-images.condecdn.net/image/rdgrbv1V1p7/crop/405",
            "http://gq-images.condecdn.net/image/7ZMD4wOlz3V/crop/405"
        ],
        "text": "Story byNick Carvell\n        \n            Nick is Associate Style Editor of British GQ\n        \n    \n                            \n                            \n                            \n                            Tuesday 10 January 2017\n                            \n                        \n                    \n\n                    \n                        Remember when we said there was a whole other section of the new Polo Ralph Lauren shop on Regent Street that was locked away - and that we were sworn to secrecy about it? Well, we're finally allowed to spill the (roasted) beans. This Thursday, Ralph's Coffee & Bar is opening up in-store.This is the first time that the label has opened one of its restaurants here in Britain - and it's a beautiful hybrid of its other outposts around the world, combining the intimate feel of Ralph's in Paris, the barista brilliance of Ralph’s Coffee in New York and the after-hours Manhattan elegance of The Polo Bar.\n\n\n    \n        Advertisement\n            \n        \n    \n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\nKitted out in that kind of all-American style that's made Ralph Lauren world-famous (polished brass, dark wood panelling, rich green fabric and saddle leather on the seats, and plenty of horse-related paraphernalia) and with under 40 covers, the bar has that cosy, quintessentially intimate feel of an East Coast gentleman's club.\n\n\n    \n        MORE FASHION\n        \n            \n                \n                \n                \n                    \n                        The women of Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The women of Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        The strongest street style at Pitti Uomo AW17\n                        \n                            \n                            \n                                \n                                    \n                                \n                                \n                            \n                        \n                        \n                            STREET STYLE The strongest street style at Pitti Uomo AW17\n                        \n                    \n                \n                \n                \n                    \n                        Your first look at Bottega Veneta's super-luxe summer line\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Your first look at Bottega Veneta's super-luxe summer line\n                        \n                    \n                \n                \n                \n                    \n                        Jim Chapman on his new year's style resolutions\n                        \n                            \n                            \n                                \n                                \n                            \n                        \n                        \n                            FASHION Jim Chapman on his new year's style resolutions\n                        \n                    \n                \n            \n        \n    \n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\nThis vibe doesn't just come from the the decor - it's also built into the menu. Serving breakfast and light meals, you'll find classic stateside comfort food like club sandwiches, cobb salads and cheesecake on offer, as well as more European options such as tuna tartare or celeriac soup.However, as you can tell by its name, the emphasis of the establishment is on its drinks offering (its worth noting that the beverage menu is twice as thick as the one for food).\n\n    \n        Advertisement\n            \n        \n    \n\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\nAs well as an impressively broad selection of coffee styles to cater to even the most demanding caffeine consumer, from Cortado connoisseurs to Americano aficionados (all brewed using Ralph's signature blend using organically grown beans and crafted by American roasters La Colombe), there's also a fully stocked bar manned by some seriously talented mixologists.You can get a special preview of Ralph's Coffee & Bar here in our gallery, but if you truly want to experience the sort of stellar sprit action on offer at home before you come into the city, we've got the recipe for one of the bar's signature cocktails exclusively below. Consider your appetite whetted.How to make a Ralph Lauren Regent Street Sour:\n\n\n    \n        \n        \n    \n        \n            \n        \n    \n    \n\n    \n\n\n\n\n    \n        Advertisement\n            \n        \n    \nIngredients:Ford's Gin (40ml)Cointreau (20ml)Pomegranate (15ml)Egg White (10ml)Lemon juice (25ml)Lemon zest for garnishMethod:Shake all ingredients together, discard ice, shake again as “dry” shake, strain into coupe glass, zest and serve.\n    Ralph’s Coffee & Bar is now open at 173 Regent Street, London W1B 4JQ. ralphlauren.co.uk\n\n                    \n\n                    {\"article_uid\": \"av2Y9v8zXEM\"}\n                    \n                        Share this Article"
    }
]
