[
    {
        "heading": "",
        "img": [
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/weekend.jpg",
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/gabi.png",
            "http://www.stylegirlfriend.com/wp-content/uploads/2016/10/messaging-inpost1-709x133.png"
        ],
        "text": "Are you ready for Style Girlfriend’s second-annual No Jeans January challenge ? Good. Us too. All month we’ll be throwing down the gauntlet: 31 days, no jeans, game on. Each week, we’ll focus on a jeans-free alternative and share daily outfit inspiration . What’s more? We’ll be rewarding a stylish reader every week who shares a non-denim selfie using #NoJeansJanuary on social media with #SGapproved swag. A few sleeps ago (ahem, four months’ worth of sleeps ago), Gabi highlighted what turned out to be a pretty polarizing pant: the cropped trouser . Although the ladies of Style Girlfriend have nothing-but-love for this intentionally shorter trouser, we can see how you’d want to avoid a look that’s dangerously similar to the accidental high-water pants of the past. Until now OKAY. The key to nailing this style? A purposeful fit. And by that, we mean a cropped trouser with a slightly tapered leg and a rising hem between one to three inches. Pairing this pant with a casual outfit will take some of the “is this office appropriate?” pressure off while leaving room to branch out into a trendy-meets-classic vibe. Trousers: Vince, $265 | Bomber j acket: Topman, $150 | Tee: Champion, $38 Socks: Gap, $8 | Shoes: Clarks, $79 | Duffel bag: Uri Minkoff, $150 Watch:  Diesel, $100  | Sunglasses: Steven Allan, $165 | Gloves: Gizelle Renee, $39 All purpose wash: Triumph & Disaster, $34 | Matcha powder:  Mizuba Tea Co., $20 “Y’all thought we were gonna let you forget about our love of cropped trousers? You’re not getting off that easy.” TELL ME: ARE YOU ON BOARD TO TRY CROPPED TROUSERS? HOW WOULD YOU STYLE THEM? Pin It"
    },
    {
        "heading": "",
        "img": [
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/Untitled-design-709x355.png",
            "http://www.stylegirlfriend.com/wp-content/uploads/2016/10/messaging-inpost1-709x133.png"
        ],
        "text": "It’s that time again! Time for my new year’s resolutions. For yours, too! For all of ours! ::breaks into song at the top of her lungs, ‘WE ARE FAM-IL-YYYY’:: Actually, it was that time l-i-i-i-ke, a week or two ago, but here we are. Honestly, it’s hard to believe we’ve already dove headlong into 2017. If I expected a post-holiday lull, I was sorely mistaken. I always go into Christmas thinking I’ll make time to plan for the coming year after the holiday drama—I mean festivities—have died down. I picture myself sitting cross-legged, a chai-scented candle burning in front of me, a dream journal splayed open in my lap, visualizing my way into a prosperous, love- and abundance- filled new year. But y’know what? That never happens. Last year I did take a few days for myself down in Costa Rica before joining friends in a nearby beach town for New Year’s. I had every intention of, well, setting intentions, and getting my mind right for 2016. It didn’t really work. I know there’s a difference in being alone vs. lonely. As in, you can be sitting right next to someone and if they’re not the right someone you feel lonely as hell. But this was different. I was all by myself and feeling bummed thinking backwards and kind of freaked out about looking forwards, so I just…didn’t do much of anything, really. I read books (Girl on a Train, more like, Girl on a Brain Drain, amirite? No? Wrong audience?) . I got some sun. I did have some epiphanies around the mental release brought on by adding limitations to your life, but I didn’t really set any goals for the new year. I didn’t say: This is what I learned in 2015, and here’s how I want to grow from it in 2016. Ultimately what it came down to is that I didn’t want to reflect. 2015 was a weird one. Lots of growing pains, which is in itself not a bad thing, but not necessarily something you want to savor like it’s a cup of coffee in a Folger’s commercial (side note: do they still make Folger’s commercials where someone makes coffee really early in a beautiful house and then someone else – or maybe a dog – comes and joins them? They never get served to me on Hulu if they do, and I don’t have a TV so I don’t know what normal commercials run these days. So Hulu, if you’re reading this: I know I don’t drink coffee which you also probably know because the internet knows everything, but please serve them to me, anyway. I love them and promise to be a Folger’s evangelist to all my friends. Look, I’m doing it already!) As it turns out, 2016 did really feel like another ‘rebuilding year’ for SG and my life (one and the same, really) like a Pac-10 school just trying to make the Buffalo Wild Wings Citrus Bowl. And if anything, 2016 felt like more of a slog. Sure, there was the obvious but beyond that, it felt a bit at times like I was walking through waist-deep mud. I wanted to go faster, but couldn’t. Or didn’t, anyway. But whether the mud was of my own making or not is for another post (or more likely, my therapist) ; the point is, 2017! New year! New possibilities! Let’s do this! Aspirational instagram quotes aside, I’m feeling hopeful—empirical data notwithstanding. I mean, okay. Are resolutions scientifically proven to fail , creating a depressing shame spiral that leaves the resolution-maker worse for wear before even flipping the calendar to February? Sure. Does that mean I love ‘em any less? Nope. Because aspiring for better—to want to make an effort at making an effort —is always a good thing. Even if you fall short, you’re still better off than you were before. Unless your resolution is to like, not kill people, and then—oops, you totally kill some people. That’s more of a binary, no-question fail that should in fact result in a shame spiral. And jail time. Beyond all that, I let myself off the hook recently in making a resolution for this year because I was still up to my elbows with the last one. December’s always busy for us at work with gift-giving and -getting season, so most of my free time recently has been spent hustling to button-up recaps and downloads from projects last month. What did we do right? (Some stuff!) What can we do better next time? (Plenty!) Now that all that is out of the way, I am ready to think about January. And 2017 in general. Sure, we’re already in full swing with No Jeans January , but that’s been in the works for awhile (side note: are you guys enjoying it? do you love it? hate it? indifferent?) but better late than never. So getting to it already. This year I’m focusing on simplicity . Even the word sounds enticing, doesn’t it? Like a hot chocolate made with almond milk so it’s kind of good for you but then you also have the barista top it with a big-ass homemade marshmallow from the display case and you are just like, “WHAT? I DO WHAT I WANT.” Yes, simplicity’s like that. I am super duper guilty of taking on too much, and prioritizing work over…pretty much everything else. Which, fine, that’s my choice when it comes to putting Style Girlfriend ahead of things like “building a family” or “nurturing hobbies” (did I spell that right? maybe the “h” is silent?), but fetishizing being busy is not a good look, and what’s more, I don’t want to be too busy all the freaking time. I need to find a way to build a career and build a personal life in tandem. Cutting out anything extraneous will help me get there. It’s not sexy or flashy or even all that tangible. But at the end of 2017, I hope to be able to look back and think, “ Ahhhhh ” instead of “AHHHHH!!!!” That, to me, will be success. So, tell me: Are you setting a resolution this year? If so, what is it? If not, why not? Pin It"
    },
    {
        "heading": "",
        "img": [
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/NJJ-WEEKLY-trousers-709x355.png",
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/work-presentation.jpg",
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/megan-njj.png",
            "http://www.stylegirlfriend.com/wp-content/uploads/2016/10/messaging-inpost1-709x133.png"
        ],
        "text": "Are you ready for Style Girlfriend’s second-annual No Jeans January challenge ? Good. Us too. All month we’ll be throwing down the gauntlet: 31 days, no jeans, game on. Each week, we’ll focus on a jeans-free alternative and share daily outfit inspiration . What’s more? We’ll be rewarding a stylish reader every week who shares a non-denim selfie using #NoJeansJanuary on social media with #SGapproved swag. Trousers. Such a fun word to say, right? Trousers. TROUsers. Trouserzzz? Yet the thought of actually wearing them tends to dampen every guy’s style spirits. I get it. If you’re not careful, an outfit that includes dress pants can veer towards the corporate. The boring. The stuffy. But it doesn’t have to be that way. This week, we’re showing you five different looks featuring trousers that’ll make you forget all about that denim collecting dust in your closet. I promise. Trousers: J. Crew, $80 | Blazer: Zara, $80 | Sweater: Uniqlo, $99 Socks:  Kingsman, $35 | Shoes:  Aldo, $130 | Pocket square: Nordstrom, $40 Watch: Nixon, $125  | Glasses: EyeBuyDirect, $70 | Belt: Bonobos, $98 Scarf: Faliero Sarti, $123 | iPad cover:  Sena, $60 | Grooming set:  Murdock London, $79 “Look, we all know you’ve got navy and grey trousers at home already. Why not go a little crazy with your next pair?”   TELL ME: HOW HAVE YOU STYLED COLORED DRESS PANTS? Pin It"
    },
    {
        "heading": "",
        "img": [
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/date.jpg",
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/jennifer.png",
            "http://www.stylegirlfriend.com/wp-content/uploads/2016/10/messaging-inpost1-709x133.png"
        ],
        "text": "Are you ready for Style Girlfriend’s second-annual No Jeans January challenge ? Good. Us too. All month we’ll be throwing down the gauntlet: 31 days, no jeans, game on. Each week, we’ll focus on a jeans-free alternative and share daily outfit inspiration . What’s more? We’ll be rewarding a stylish reader every week who shares a non-denim selfie using #NoJeansJanuary on social media with #SGapproved swag. We’ll give it you straight: Rolling up to a post-work date in a disheveled suit or a less-than-fresh lunch stain on your sweater isn’t the best look. This is why we love the idea of carving out time to swap outfits and leave your work mindset at home before a big date. As for the outfit to slide into? You’ll be sure to impress in a pair of tailored textured trousers coupled with – drumroll please – even more texture. A cozy sweater and a suede bomber is a surefire way to take any simple button down to the next, non-corporate feeling level. Then, take the whole look home with a sharp pair of leather sneakers for the off-duty feel. Trousers: Club Monaco, $298 | Shirt: Satudays NYC, $120 | Jacket: Bellfield, $230 Sweater:  Carhartt WIP, $64 | Socks:  Maple, $29 | Shoes: Kenneth Cole, $116 Scarf: Topman, $18  | Fragrance: Gucci, $88 | Card holder: Hugo Boss, $90 Keychain: Michael Kors, $3 4 | Whisky glass:  Cool Material, $27 “Y’know how girls talk all the time about wanting a guy to make more of an “effort?” Four words for you: Trousers. On. Date. Night. (You’re welcome.)” TELL ME: WHAT’S “MAKING MORE OF AN EFFORT” FOR YOU WHEN IT COMES TO STYLE? Pin It"
    },
    {
        "heading": "",
        "img": [
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/casual-chino-outfit.jpg",
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/gabi.png",
            "http://www.stylegirlfriend.com/wp-content/uploads/2016/08/messaging-inpost2-709x133.png"
        ],
        "text": "Are you ready for Style Girlfriend’s second-annual No Jeans January challenge ? Good. Us too. All month we’ll be throwing down the gauntlet: 31 days, no jeans, game on. Each week, we’ll focus on a jeans-free alternative and share daily outfit inspiration . What’s more? We’ll be rewarding a stylish reader every week who shares a non-denim selfie using #NoJeansJanuary on social media with #SGapproved swag. A cool pair of slate chinos, a shearling denim jacket, and a striped sweater? Color.Me.Impressed. If that’s not enough of a selling point, let’s look to the utter ease of this minimal outfit. It’s a combination of basics that you’ll be able to wear in almost innumerable pairings without feeling too… basic . The kicker? You can pump up this simple style by reaching for standout accessories in bold colors or conversation-starting patterns. Chinos: Billy Reid, $145 | Denim jacket: Saturdays NYC, $285 | Thermal tee:  Old Navy, $17 Socks:  Urban Outfitters, $8 | Shoes:  Club Monaco, $325 | Beanie: City of Neighbourhoods, $38 Watch:  Nixon, $175  | Gloves: Gap, $30 | Water bottle: S’Well, $25 Backpack:  Rains, $90 | Hair cream:  Jack Black, $24 “Sure, you can always slip into jeans on the weekend, but why not skip ‘em just once in favor of a chinos-anchored look that feels just as comfortable and shows your style doesn’t take time off? Topped with a striped henley and cozy accessories, you’ll be all over 2017’s biggest trend – hygge (it’s pronounced hoo-gah, and you can learn more about it here ).” TELL ME: WHAT’S YOUR FAVORITE WAY TO WEAR CHINOS? CASUAL OR DRESSED UP? Pin It"
    },
    {
        "heading": "",
        "img": [
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/patterned-trousers.jpg",
            "http://www.stylegirlfriend.com/wp-content/uploads/2017/01/brittanyhammondseditor.png",
            "http://www.stylegirlfriend.com/wp-content/uploads/2016/10/messaging-inpost1-709x133.png"
        ],
        "text": "Are you ready for Style Girlfriend’s second-annual No Jeans January challenge ? Good. Us too. All month we’ll be throwing down the gauntlet: 31 days, no jeans, game on. Each week, we’ll focus on a jeans-free alternative and share daily outfit inspiration . What’s more? We’ll be rewarding a stylish reader every week who shares a non-denim selfie using #NoJeansJanuary on social media with #SGapproved swag. There’s easily between two and 200 compelling reasons to commit to a patterned trouser. Though, we’ll stick to two for now: A classic subdued pattern paired with solid basics is all it takes to create a non-wallpaper looking outfit. If you’re feeling bold (which we imagine you will be), opt for a bright color shirt or jacket and a contrasting yet subtly patterned accessory to amp up the look. Trousers: Todd Snyder, $189 | Jacket: J. Crew, $248 | Sweater: Everlane, $100 Socks:  Maple, $29 | Chelsea boots:  Zanzara, $160 | Backpack: Jack Spade, $124 Belt: Asos, $10  | Beanie: Zara, $10 | Watch: Emporio Armani, $175 Headphones: UrbanEars, $50 | Body balm:  Aesop, $35 “A sweater in bold blue, sleek chelsea boots, and a camo backpack? Yeah, we’d say this look safely steers clear of ‘boring corporate guy.’” TELL ME: HAVE YOU TRIED PATTERNED DRESS PANTS OR A SUIT? Pin It"
    }
]
